{
    "features": [
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Cosmic PurpleSize: 4+64GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Cosmic PurpleSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 6+128GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Moonlight WhiteSize: 6+128GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Space BlackSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Cosmic PurpleSize: 4+64GB",
        "Colour: Space BlackSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Cosmic PurpleSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Cosmic PurpleSize: 6+128GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Cosmic PurpleSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Cosmic PurpleSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Cosmic PurpleSize: 4+64GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Space BlackSize: 6+128GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Neptune BlueSize: 6+128GB",
        "Colour: Neptune BlueSize: 4+64GB",
        "Colour: Moonlight WhiteSize: 4+64GB",
        "Colour: Space BlackSize: 4+64GB",
        "Colour: Neptune BlueSize: 6+128GB"
    ],
    "short-reviews": [
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Wow",
        "⚠️ Don't buy! Good on paper but too bad in performance ⚠️",
        "This product is very very good",
        "Highly recommended for people who doesn't want confusion on buying this price range...",
        "Perfect gadget partner",
        "Best in budget",
        "A Perfect All Rounder.",
        "Nice",
        "Wifi",
        "Best",
        "Magnificent and better than best.",
        "Worst build quality, Don't buy!!!!!!",
        "The UNDISPUTED CHAMP OF THE BUDGET SEGMENT",
        "Nice budgeted Phone. Good for daily use",
        "Good not much better",
        "Wast of Money and Time.",
        "Bad phone",
        "Not a grip phone",
        "Awesome Phone Must be Purchased.",
        "Best phone ever #redmi #mi",
        "Best Smartphone In This Price",
        "Good product",
        "Network connectivity is too low",
        "Redmi note 8 Review By Lovejeet Singh",
        "Not good",
        "Performance 🤔🙄😟",
        "Budget King | But NOT for Gamers",
        "Be careful",
        "OK google not supported....",
        "best ever phone in 10k",
        "Killer phone",
        "good!!",
        "Bugged software with lot of bloatware",
        "Completely disappointed product. Don't Buy",
        "Fine",
        "Great phone under 13k",
        "Shocking Camera Phone",
        "Good phone with few irritating discrepancies",
        "Not a smooth ride",
        "Please check before you do shipment",
        "Vishal Bandewar",
        "Nice quality",
        "H",
        "Beast Phone",
        "Read before buying...",
        "Please improve the battery backup",
        "Good camera, must install G-cam",
        "Faulty product.",
        "Best phone ever",
        "Nice phone in budget",
        "Third class Redmi.",
        "Redmi note 8 after 10 days of usages; pros and cons",
        "Nice",
        "Redmi note 8 front camera is lower quality",
        "A Complete All-rounder",
        "Serious issue with upi updation..",
        "bellow average",
        "Just mind blowing",
        "Redmi note 8 | worth every penny",
        "Below Average",
        "Great VFM camera mobile under 10k",
        "Best camera phone under 10K",
        "Amazing mobile",
        "Value of money",
        "Awesome Mobile",
        "Nothing special...",
        "Use Instagram and jio video calling ...worst in that",
        "Heating Problem,worst quality in Camera, battery drains fastly",
        "Superb phone",
        "nice one",
        "Got a defective one",
        "Redmi note 8(4gb,64gb,Moonlight White) Pros & Cons:",
        "Superb,bt many prob.",
        "Bluetooth, and keyboard issue",
        "not good products",
        "Best is quality and quantity",
        "My favourite phone",
        "Angry with Redmi Printed Screen Paper",
        "Beautiful and awesome",
        "Value for money"
    ],
    "long-reviews": [
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Nice product ...India's No One. Brand",
        "Redmi has been a prominent smartphone brand which has given a quality product at a pocket-friendly price range. I have a lot of expectation from Xiaomi. I have used almost 4 of their smartphone in last 2 Years but truely disappointed with Note 8.I Won't use the complex word & would like to make the review very simple & to the point.The Negative things of Redmi Note 8 are:-(1) 😔 Battery drains very fast if you're using Wifi, low signal area & of course while gaming like PUBG & COD. Needs to recharge after 6-8 hours. But 18W Fast charging will help you to charge quickly but that doesn't solve the entire problem. (2) 😡 Can't disable pre-installed apps. Lots of annoying ads & Can't give these phone to someone new to android or smartphone (eg. Parents because of unnecessary ads & you need to be very careful to handle them). (4) 💥 Flashlight very poor ( Note 5 Pro, A3 & Note 8 Pro has better flash). (5) 👀 Unnecessarily forces to use location in all apps (which is most annoying). Why is Mi so much interested in our location? (6) 📷 The Quad camera works fine but zoom doesn't make much difference. Good for normal use & Justify the price segment. (7) 🤮 Everyone tries to make UI & Design as simple to operate but Xiaomi MiUi is so disgusting & difficult to operate. (8) 🤕 Apps crash here and there. I hope they will consider this in upcoming updates.(9) 🔥 Heating issue while charging the phone & while using it for even 30 minutes.⚫ Overall: It is a nice phone for average use but if you're amazed by its so-called features & you think that it can survive your high-end requirement then be aware it is not for you.",
        "This product is very good and very good quality thank you Amazon thank you so muchI am use this device 6 day very smuthly and very fast and fast charge charging time 1 hour 45",
        "To all consumers who are looking for a decent midrange smartphone today, this Redmi Note 8 is a solid pick.Ads? You can disable it on Settings, though disabling it one by one but worth it after doing it.Chipset? It's above average since it can play graphic demand games very well. Day to day work? So dang good. Transition between apps is no slouch.Compared to same level smartphones the display looks crispy, and speakers are powerful. At last, its highly customisable system brings a great experience for hard users.Cameras? Stock app is straight garbage (except the macro mode). Just install google Camera and you're good to go. Details will be flagship like.The battery it's good as well and gaming it's a \"just good\" experience, not bad at all (smooth on high preferences, not ultra)Price? Bang of the buck for this segment!Highly recommended for people who doesn't want confusion on buying this price range...",
        "I purchased it from redmi store. Its performance is awesome.Super clarity display, good battery backup, super loud speaker with thunder voice.... Etc.... U can buy this without thinking more",
        "King of budget phones, but 3 star because of very annoying add's. What the hell xiaomi thinking. They didn't given it for free i have paid for the device!Amazon delivery 5/5 (on time)Camera 4/5 wide angle is very goodDisplay 5/5Network 4/5Charging. 3.5/5 its taking aprox 2.02 min to  3 min if mobile data is ONGorilla glass5  3/5 (already got a scratch even after taking careFinger print  4/5 (not fast as other phone's)Face unlock 3/5  ( realme u1 is double faster)IR blaster works great",
        "It took around 9 days to get the product delivered. It's a great phone. Battery backup is awesome. Fast charger is provided in the box. Front Camera isn't that great, but still, it's very good. Rear camera takes good pictures. Fingerprint is also very fast, but little bit slow as compared to my Realme 3 pro. Still fingerprint is fast enough. Also, the glass back is awesome. Overall a good phone. Got it for 8,999/-Also got Rs 100 Amazon cashback. It's a killer deal even in 9,999/-. Just go for it.",
        "Purple is too good.",
        "If u are a WiFi user ....then pls don't buy this phone....I have received replacement with same problem.So finally I returned the phone ( as both phone have same WiFi issues)May everyone didn't notice the WiFi connectivity time .....I stay full time in WiFi ,so pls check how longer it stay connected to WiFi ..In my case after 2 to 3 hr ...WiFi shows unavailable until I restart phone.",
        "Best smartphone under 10k",
        "You may miss such like a worthy mobile in just 13k, if you don't buy. Awesome product. Be hurry to purchase.",
        "I have purchased redmi note 8 at 25th October and within 8 days Dust particle accumulated in camera lensDon't buy!!!!!!!!!!",
        "I got this device on 1st November 1 week before our famous Jagadhatri Puja in Chandannagar and this was my best purchase till date.Design:- First of all this thing just glows. The very first moment I saw this phone I was literally drooling. The back and froth Gorilla Glass back gives this an unmatched premium feeling in the hand.So classy so elegant yet so eye catching and charming. At least 5-6 strangers have asked me about this device. This phone is sure a looker.Camera :- The camera can give competition to phones that are 2-3x more expensive than this.This phone with GCam 7 just blows the competition out of water, nothing even comes close.The GCam 7 works on this device so flawless without any lags or stutters whatsoever it's pure magic just see the samples, straight out of the camera.The selfies of this device are even better than iPhone 7 , I compared them side by side and the selfies frrom this one have better dynamic range, better contrast and better depth effect. Night Sight too works like a charmGCam7+ Redmi Note 8=♥️🔥The addition of wideangle and macro are just cherry on the top. Wide Angle takes decent shots is good lighting conditions and you can take videos with the macro cam as well. Both does the job pretty well. I will give the GCam 7 link at the end🤗Display:- The FullHD+ screen, yes a FullHD+ screen in a sub 10K phone, the screen is bright, vibrant produces great colour and contarsts and watching YouTube videos and movies makes the experience so much better.Performance:- 665 is a very well rounded SoC it's running very well, without any lags or hiccups experienced till date and PUBG runs pretty smooth without any lags and stutters whatsoever and this doesn't heats up at all.Battery and Charging :- I have experienced about 1 and 1/2 days of battery backup with moderate usage and thanks to the 18W fast Charge it charges up 0-80 in around 75mins.Speaker:- The downfiring speaker is very loud and crisp you can literally feel air pumping out of the speaker in a bass heavy song and the speaker has a self cleaning feature too. The earpiece is loud crisp  and clear too.This phone media consuming to much better.Extra Features:-IR blaster ✔️Gorilla Glass 5 back and front great hand feel, premium built and scratch resistant✔️Self cleaning speaker✔️Wireless FM✔️P2i coating✔️USB C✔️Fast 18W charger in the box✔️Cons:- There are ads in the UI but a mere 5mins of tweaking and voila you will never see a ad in your deviceVery very difficult to get hold off one in these flash sales.Overall this phone is redefining what a budget phone can do, from a Great built quality with Gorilla Glass 5 on both front and back, with downright best camera in this segment, to the presence of great speakers, to the presence of P2i water resistant coating which gives a great peace of mind to the presence of IR blaster, Wireless FM to the presence of USB C this phone is a perfect from every department no phone even comes close.If your budget is within Rs 12000 this is the best buy you can buy just go for it✌️Fair warning:- After using the GCam 7 on this device you will have a difficult time switching to any other phone even 2-3x more expensive cause the picture quality produced by this phone is just lit.Get this phone asap and Install GCam 7 and let this perfect combo amaze you♥️🔥Thanks for reading this review if you find this helpful like this and have a great day.",
        "Nice budgeted Phone:Some points as per my opinion: (out of 5)1-  Battery Backup 5/5.2-  Camera 4.5/5  (Micro Lense is use)3-  Display - 5/54-  Sound Quality - 5/55-  Fingerprint Unlock 3/5 (Small size fingerprint unlock)6-  Face Unlock - 4/5 (Little Slow)7-  Performance - 5/58-  Looks - 5/5 (Premium Look)9-  Weight - 4/5 (Feel heavy)10-  Gaming Performance - 4.5 / 5",
        "Good not much better as expected the heating problem is facing and fingerprint is also not work properly sometimes and ...battery also draine fast but it has fast charge so it can be charge fast ..if u buy go for realme mobiles",
        "Very Bad experience with this 😞 phone quality for Camera , Internet speed, and Battery. Camera quality is worst, it's not even 12mp camera. Charger is not charging fast, it is taking 2 hrs to get full charge.Never buy a phone before read a review by certified buyers. You tube people making false video for marketing of phone brand so never trust on you tube videos.",
        "Bad camera quality.Phone hang from the first day.Not smooth to operate",
        "Very heavy wait in phone",
        "Pros- (1)- Super premium design  (2)- Glass 5 back and front, that's  why phone looking dashing.  (3)-403 PPI density make display good.  (4)-Fast Finger unlock as well as face unlock.  (5)-Battery back also awesome 2 days for normal using  (6)-fast processor makes phone great while  navigating.  (7)-No words for camera , can take profession picture powered by Macro lens.  (8)- Purchased this phone without any confusion and headache.  Cons-- No cons no negative comment for this phone in this price range, This comment provide after using  Galaxy note 8, samsung M30s , nokia 6.1 Plus,",
        "As far as the cameras are concerned.The Redmi Note 8 is rumoured to pack 64-megapixel camera.It is expected to sport a camera on the front for selfies.Sensors rumouredAccelerometerAmbient light sensorCompass/ MagnetometerProximity sensorand fingerprint sensorThe Redmi Note 8 supports face unlock , Which is in Trend As wellAs per the Expected Prise Ratiosome features are Incredibly AwesomeAndroid 9 PieFace UnlockQuick Charge 425mp Front Facing Cam#redmi #mi 😎😎",
        "Best Smartphone In This Price.",
        "Very good product and camera quality is extremely good",
        "Network connectivity is too low and battery backup is not good ,camera quality is not that what they show in add, very dull with least details camera picture",
        "i purchased redmi note 8 in first sale on 21st october i am very happy with the performance and build quality is really great  redmi gave 18w fast charger in box i am very happy the price. (key specs) processor snapdragon 665,4000 mah baterry with18w fast charging,quad cameras (8+48+2+2),13mp selfie cmaera,6.39 inch fhd display,fingerprint sensor face unlock i am giving some picture sample taken by redmi note8 if u want a good phone at price of 10k then take redmi note 8.  please like my review",
        "Camera not good. Bad performance . Battery  charging very slow . I don't like this product.",
        "Every thing looks good except camera.#After zooming photo black spots found on face. You can see it on sample pic.#Tuch is little bit slow.",
        "If you are planning to buy Redmi Note 8, check my experience as followsPro's :1. Camera: 48 MP Quad camera gives well exposed output. Note 8's camera is one of the Best in under 10k price segment.- It also have ultra-wide, macro depth sensor.- Front camera is also great.- Capable to shoot 4k 30 fps, slow motion 120 fps.2. Snapdragon 665: which is handles daily to day multitasking pretty well.3. 4000 mAH Battery: easily lasts for a day,18 watt charger included inside box which helps to charge mobile fully in 2 hours.4. Notification LED.5. IR Blaster.6. Dedicated SD card slot.7. Headphone jack.8. Gorrila glass 5 on front and back.Con's:- When playing PUBG with high settings, sometime it lags with frame drops.Verdict:If you are looking for phone for daily use with amazing camera quality, then Note 8 is right choice for you.But if looking for gaming then don't buy this one.",
        "The phone has major touch glitches. After trying at least 3-4 times, got this phone recently. All the excitement of receiving a new phone vanished when the touch started acting up. The phone shudders and starts operating on its own without even touching it. The camera features are quite good but the phone should be made stable first. Disappointed. Don't buy in flash sale. Their testing process is still going on.",
        "Ok Google feature is not supporteing.Showing language ia not supported in access with voice match setting for all languages....So u can't use ok google.",
        "display 10/10camera 8/10processor 9/10sound 10/10charging 9/10design & build quality 10/10price 10/10best ever phone in 10kREDMi NOTE 8👌only delivery is experience very wrost by amazon almost 12 day i wait for,i gave 0 star for delivery",
        "Awesome Camera at this price range.Stunning OutlookPowerful performance4000 mah battery with fast charging support(18watt charger in the box)Triple slot",
        "cool mobile.. its not completely purple but mixed with blue also.. the camera ll touch the surface wen used without a proper pouch.. but i like it ,front camera z not tat good. over all worth the price.. very good package for 10 k..",
        "Lot of issues with the phone software. Loads of unwanted stuff on the phone. Screen is very bright in the night and even the lowest setting does not work well. Google Assistant does not work. Voice activation for Assistant does not work. Xiaomi does not have answer for it. No point getting a phone and struggling with it. Better phones available.",
        "I purchased this product during the first flash sale. I got a completely diffractive phone. When I switch on the phone I found that touch screen is not working. So I fail to move to the next pages for activating phone functions. I don't expect this from Redmi and Amazon.",
        "Best phone under 10k price range",
        "This is my 3rd phone.....1st 2 ones are  moonlight white......& this one is cosmic purple...which sort of blue on the top & it comes downnu can see purple.The phone looks feel really good.....& This colour looks stunning...camera seems good & it takes some good images.... overall satisfied",
        "I'm a photographer and after using redmi note 8 48mp camera i shocked and thought that now i don't need too much to use Dslr camera everywhere because redmi note 8 have awesome camera😉😉😉I'm sharing images clicked in note 8 please see that",
        "side & Bottom border area keyboard keys are not working properly, like p, q, capslock, backspace, '?123', navigation keys like back, home etc. Sometimes they work sometimes they don't, it's very irritating when you have to correct spelling by deleting the misspelt word due to miss of the letter. At least 3 out of 10 hits are missing regularly. In addition to it, voice during the call is leaking in the earpiece, it's like I am hearing my own voice while talking. Poor feeling. Otherwise, the phone is working fine. Didn't expect this from such a brand. Really disappointed------------------------------------------REPLACED------------------------------------Got it replaced with another handset, though the keys I mentioned above seem to be responding fine now, other areas are giving similar problem, like the 'abc' key which is used to switch the keyboard from letters to number and symbols. Also, after dropping down the notification shade the setting gear icon is not responding properly.  Screen touch issues lies in many places over the screen. So the hit-miss pattern is still on but on some other areas. This is very irritating. The voice leak during call still lingering over some or other calls.",
        "After all the hype I managed to buy the blue colour variant 4GB/64 GB. My initial impressions were very disappointing and after using the phone for two weekks I can safely say that phone has some bugs and quallity issues which I would like to mention:1) Biggest flaw is notification icons disappearing from the notification shade after appearing for few seconds. I tried my best to fix it by going through number of suggestions available on internet including factory reset. Hopefully Xiaomi will try to fix it.2) The flashlight/torch is very weak and even my older Redmi Note 3 has brighter torch/flashlight.3)Camera is pretty average and hard to believe how the 48 mp mode is giving average pictures. Wide angle mode is also poor and the other two modes are in my opinion just gimmick.4)One basic flaw if you are using two sims the second sim icon will be displayed only when you are using wifi.  I am really disappointed with these bugs/defects and just hope this is my last association with Xiaomi. Last but not thr least if you are looking for a ohone with great experience of gaming then you should not opt for this phone.To conclude if you are a Xiaomi fan just opt for 10k version and hope that some of the errors mentioned above are fixed by Xiaomi.Review after MIUI 11 Update:- I got an OTA for MIUI 11 on 27th November 2019. After the update the problem of disappearing notification icons from the notification shade has been solved. Second sim icon is also now displayed in the notification shade which was earlier missing. I can now say without any hesitation that this is the best phone in 10k range.",
        "The most disappointing think is that the SIM slot is put already by the company upside down and slightly bend from the top I have to bend it also on the other side to make it straight and when I put the SIM there is no chance that will keep the SIM card but it show the SIM card range so it means it's not damage just slightly bend and I don't like the redmi branding on the front I am expecting the clean look",
        "Very Good Color and Fast Delivery Amazon.. Redmi Note 8 Like",
        "Nice quality, smooth finger frint , camera quality superb , everything is superb in this new lauch models 10 out of 10 marks",
        "This is good",
        "Nice camera .... Game play like SD855. Battery back up good ... Slight heating phone.  whileplaying games  but its ok .... Under 10K  this beast phone among other .... its my 3rd series of Redmi phone ... .. Thank you for making this amzijg phone ...Battery charging full in 1:45 hrs  ...",
        "Only reason I bought it, it's supports dual app asAs of now Realme clone supports phonepe and many more so.....Before I buying it I guessed it could have battery have issue. Now I am facing the same. As Redmi 4000mah is not enough to run a fhd mobilesmoothly a day. This is same with Redmi note 7s.Now about the camera, sound, display , charging speed, all are good.My old Realme 1 has good battery life than this.I hope you got a little idea about Redmi note 8You can buy it . If you love Redmi .In one word I also love this mobile as it comes with a full loaded features and prices.",
        "Lightly Disappointed with battery backup . And slower connection.Bad response from agent to replacement it's not good in marketing behaviour",
        "The camera is good, but you will have to install Google camera to get the best out of it. The stock cam is not that great.The build quality is good and so is the designThe display could have been better, not that great. The display on my asus zenfone maxpro m2 is better, according to meBiggest drawback is the flash sale - It's a hit or a miss. However, I got it on day 1.",
        "I was very happy that I bought it in first sale but my happiness ruined because Amazon delivered me a faulty product. Whenever I try to turn on my mobile from sleep it always take 5 to 8 seconds to just turn on the screen, no matter whether I am trying with fingerprint sensor/Double tap method or pressing right side button. I tried to replace the product but Amazon checked my phone with some terrible blancco app and said that there is no fault in my mobile. They didn't replaced it. pathetic. Don't purchase this mobile from here.",
        "Best camera Phone desgin is awesome. Great Phone 6 gb 128 gb varient",
        "Redmi note 8 is best quality phone in budget.Rear camera is superb quality& processor is good. Battery is good.",
        "My two years old Motorola G5 has better downloading speed  than Redmi note 8 when using same jio network in both the phone.Even after complaining 2 times no mobile expert came to my house & made fake report that phone is ok.Never buyRedmi phone again in life because they are installing cheap components in their mobiles.",
        "This is probably the best all-rounder in sub rs 10000 (9999). I got is in 8999 with offerPros1. Very premium looking with glass design2. Display is bright enough3. A good processor ( though better one snapdragon 710 is available at same price with realme 3 pro)4. 48 mp ( really a 16mp) camera is superb5. Four camera setup gives flexibility to your photograph with wide angle and macro lens6. Night photos are also good7. 18 watt fast charg support and also inside the box availableCons.1. Glass design may get cracked when fall down from height.2. SD 710 is also available at same price range from realme3. Redmi may have used Samsung gm2 48mp sensor which is better compared to gm1.4. Though wide angle camera is good it is still an 8mp5. The Qualcomm quick charge is very slow when compared with VOOC6. It has been long days (4-5 years) redmi is using 4000mAh battery. Though it is big enough but battery capacity should be increased to 4500mAh same as its pro versionIf I find anything else I will update it.",
        "Nice",
        "I m buying redmi note 8 by Amazon it's front camera is lower level",
        "Redmi note 8 is a complete all-rounder.This review is after 15 days of usage.The pros of this phone are as follows1) PriceI got it at an effective price of Rs.8500 during the sale days. Even then @Rs.10000 it is still a very good buy.2) Built QualityThe phone is extremely sturdy, which might be very helpful for rough and tough use. And the glass back gives a very premium feel but need to be extra careful for that.Also Corning Gorilla Glass 5 protection is very helpful.3) BatteryThe battery easily lasts for more than a day with mediocre usage.4) Quick chargingThe co. a fast charger in the box, it takes around 1 hour 45 min to charge from 0 to 100.5) ProcessorIt works extremely well for day to day tasks (don't know about high CPU consumption games like Pubg and all)6) Sound qualityThe Audio speaker is loud for a normal environment.7) Dedicated SD card slot8) SizeThe phone is 6.3 inch, though bigger than palm sized phone, it is always an better option than the 6.5 inch phones which have become a trend in today's market.Cons1) CameraThe quality of camera is not like 48mp. Its not that great nor that bad. It's okay okay types.2) BloatwareThere are huge no. of pre installed apps and the ads are still very much a part of OS.3) Flash SaleI think the concept of flash sales should be dropped , due to this many people could not avail the discounts during the festive sales.4) Heating IssueThe phones heats up a bit while charging but it's completely normal considering the fast charging and other factors.5) BulkyThe phones seems bulky at times. Its somewhere round 200 gmsConclusion:The best buy at @10000 at this price range and the features.Could not ask for more.",
        "There is some serious pblm with this phone no upi supported ...U cant use upi paymnt facility in this phone ..or other function rltd to upi ..And xiaomi claims its a fast chrging not fast charging its takes arround more thn 2 hrs ...Its 10 watt chrging compare side by side  with 10 watt it is same as 10 watt no 18 watt ,fakes 18 watt charging only to compete with real me ...One major con is upi and another one is no 18 watt fast charging ..battery ok ok. No great...",
        "pooor performance in signals and camera quality is nice but oral phon is verry bad worst mobile i had ever seen",
        "Just mind-blowing in rs-9999 thank you redmi for build redmi note 8",
        "I am fully satisfied with this phone, battery is good, screen quality is good especially the black, it looks like amoled display.Gg5 glass on top is so solid that even geans can't scratch the glass, it is far superior than redmi note 7. It worth the upgrade. I got a 170k score on antutu which is very high on this price segment.The cameras are the main highlight of this phone, the 48mp takes amazing pictures and videos(4k) at night, pixel binning comes very handy at night situations.The macro camera is also good, don't bother the 2mp resolution, it takes amazing pictures.The ultra wide lens is very nice, it takes pictures at 120° angle.There is a glass covering on the fingerprint which makes it very easy to clean it.The depth sensor with the help of mi camera takes very eye catching portraits.The most amazong part is the phones comes with a 18watt charger in the box, it charges my phone from 20 to 95 percent in 1 hour.I prefer the moonlight white color of this phone, it looks so premium.",
        "Not at all satisfactory, phone hangs a lotReceived new mobile with dent",
        "Best VFM among current phones if not looking for a gaming centric phone.Ratings:Build quality: 10/10Display: 6/10 (no colour accuracy and viewing angle from bottom gives dull display, not very legible outdoors as only 390 nits brightness. Only saving grace is the FHD resolution)Cameras: 8/10 (9/10 with gcam) , wide angle 8MP too less, very less details when zoomed in.Battery backup & Charging speed: 9/10 (unfortunately no new charging animation as shown in promotion material)UX/OS: 6/10 (not buttery smooth), 8/10 (after uninstalling bloatware, disabling ads and installing Nova launcher)Speaker: 8/10 (loud & clear enough but sounds a bit tinny/hollow-ish compared to my Moto g5 plus)Call quality & network reception: 8/10Overall considering price: 9/10Good packaging and quick two day delivery by Amazon (non Prime)Edit (5-Dec-2019): After MIUI 11.0 update the new battery charging animation is now available. Hooray! :D",
        "This is the best camera phone under 10K.Battery 9/10Camera 9/10Display 8/10Look 10/10",
        "Great mobile",
        "Nice mobile camera is good value of money",
        "Awesome phoneBut delivery was very bad , it take 11 days to arrive package on prepaid order",
        "Redmi.. Please explain what does means of  48 MP camera... Totally fake is just like ordinary camera..",
        "The camera quality is way to worst during jio video calling and Instagram...were as me and my family has used many mi device those are best this is just horrible I feel like throwing this device on the manufacturer face...I can't return this device ..coz I used those things few days later after the return period got over ....I regret buying this device ...real me n oppo n Vivo were offering many good deal in the same price ..I way loyal to mi ...so without thinking twice I got this....but I regret buying this now",
        "Heating Problem,worst quality in Camera, battery drains too early , takes long time for full charging almost more than 2 hours. Worst phone. Worst quality. Heating problem",
        "Best in budget.",
        "i love the product quality and its good one in redmi products. i got  the mobile with in 2 days delivery timecamera , ram , display quality  and battery power also well even compare to other productmobile design same like normal redmi mobiles only",
        "I just received the box , as soon as i opened it I noticed a big scratch on the corner. I don't know whom to blame. Some traces of glue are also visible",
        "Redmi note 8(4gb,64gb,Moonlight White)Pros & Cons:\" Redmi launches it's new phone in the indian market from the price 9999.I'm using this phone for last 4days and this is my review.Redmi Note 8 's most attractive thing is its look,this phone comes with a glossy glass back with white and blue shade and side edges are made of plastic but it just looks like stainless steel and it run MiUi 10 based on android 9,gives you preety cool experience,but this custom ui have so many bloatware and ads.Second thing is its camera,note 8 comes with a 48mp quad camera array.first one is a 48mp camera with pro mode and ai mode.second one is 8mp 120° wide angle lens with f/2.2 really works good.third one is 2mp portrait lens for bokeh effect in photo.last but not the least is a 2mp macro lens to shoot ultimate macro shoots through your phone.And it's 13mp camera with AI mode really clicks good selfies.Next is processor,this phone comes with SD 665 processor with cloak speed of 2.01 ghz for a faster and smoother experience with adreno 610 gpu.But this phone doesn't support Pubg in Hd mode.That's a bad thing for gamers.Next is display,note 8 comes with a 2280×1080p resolution IPS display with 403ppi pixel density.And it's colour production is really good.But this phone doesn't comes with Widevine L1 certification, that's why you can't stream Netflix or Amazon Prime in full hd.But it have Widevine L3 certification.Next is battery,this phone comes with a powerful battery of 4000 mah and you will get almost one and a half day usage experience through your one time full charge.For a user like me who doesn't leave his phone for a second, it's a great thing.Interestingly this phone comes with a 18w fast charger in box.So,you can also charge your phone in no time.Next one is it's incredible sound.I just love it and i'm sure you will also love it too.It's immersive sound covers a medium sized room with high bass and treble.And there is a feature in phone called 'clear your speakers' that's also a good thing.I am telling you guys you will just love this phone.It's a killer phone from Xiomi in this price segment.If you are thinking of buying this phone,just go for it.Hope this review will helpful to you. \"__aakash",
        "The ph is superb,bt ear piece is too low,no one can listen,if the surroundings is not quiet",
        "Keyboard response time is vry badI use redmi note 8 and many days i face typing speed problem ..main jab type karta hu tho ye wo word type hi nhi karta or whatsapp mai send button par 3-4bar click karu kabhi kabhi tho bhi send nhi hota",
        "Touch having problems and back button not working properly",
        "everything is perfect except if the processor will be Snapdragon 675 or above in this price.",
        "Good",
        "we don't need Redmi Printed Screen Paper that nothing for use so why you putting this paper?please give normal transparent screen paper.4000mAh battery is not good for PUBG & other Games.overall Redmi Note 8 is a very good looking Mobile & Camera is Too Good.for more details please Visit \"UNBOXER INDIA\" YouTube Channel, Thank You",
        "Great camera quality and awesome product",
        "I gifted this phone to my brother and he is very happy with the phone. He love to click pictures and it has 48mp and clicks awesome photos. And it also supports fast charging and comes with good processor and has 4000mah which is enough for whole day use i will always prefer #redmi"
    ],
    "customer-name": [
        "Anil kumar sharma",
        "Ashraf",
        "Anil kumar sharma",
        "Arijit Mandal",
        "Ashraf",
        "Mahendrab",
        "Sadhna agrawal",
        "Amazon Customer",
        "R.T",
        "Shah Arsalan",
        "Tabish Momin",
        "Rao",
        "Anil kumar sharma",
        "Ashraf",
        "VaLLaRaSu V",
        "Aman Singh",
        "vikash kumar bharti",
        "Sunil Kumar",
        "Arjun",
        "Anand",
        "Naeem Abbas",
        "Amazon Customer",
        "Abhishek k.",
        "mukesh prasad kar",
        "Anil kumar sharma",
        "Ashraf",
        "C.Suresh",
        "Arvind C Pachegaonkar",
        "Kushal Dutta",
        "Shadab Mithagari",
        "anurag",
        "siddharth",
        "Amazon Customer",
        "Jitender kumar",
        "Saurabh sharma",
        "Bhavesh assudani",
        "Anil kumar sharma",
        "Ashraf",
        "Ashish Shinde",
        "Krishna trivedi",
        "Dr.mahesh",
        "Lovejeet singh",
        "Nikita",
        "Anjan Kumar",
        "Bhushan",
        "soumya",
        "Jitendra Singh",
        "Vibhu",
        "Anil kumar sharma",
        "Ashraf",
        "Kuldeep shakya",
        "Amazon Customer",
        "RAVI KUKREJA",
        "Rahul Yeroor",
        "Virus",
        "Krish",
        "Thakkar Jay",
        "Nitin Garg",
        "Sanjeev Kumar Verma",
        "YASH KITE",
        "Anil kumar sharma",
        "Ashraf",
        "VISHAL BANDEWAR",
        "gaurav Maheshwari",
        "Yahiya Ansari",
        "Rehan",
        "K",
        "Amazon Customer",
        "Affan Abdul Kadar",
        "AMIT PANDEY",
        "Shubham Kr Sharma",
        "Ashish Prajapati",
        "Anil kumar sharma",
        "Ashraf",
        "Sandeep Lata",
        "Aks",
        "Jain",
        "vikas chandra verma",
        "karan",
        "arfat",
        "venu",
        "Rounak Ganguly",
        "Mayank",
        "Rohil",
        "Anil kumar sharma",
        "Ashraf",
        "Tejas Belur",
        "Amazon Customer",
        "Amazon Customer",
        "Harish kumar",
        "Fahad",
        "ujale",
        "Bushra Fathima",
        "Amsidh Babasha Lokhande",
        "sarvaiya ravindra d",
        "Mohammed",
        "Anil kumar sharma",
        "Ashraf",
        "Vinay",
        "PAPAI BISWAS",
        "koushik roy",
        "bikash pradhan",
        "Amazon Customer",
        "neeraj",
        "Ranjan Manjhi",
        "UNBOXER INDIA",
        "Vivek yadav",
        "Gaurav"
    ],
    "neg-short-reviews": [
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent",
        "Superb ...😘",
        "SEXY BLUE NOTE 8",
        "Disappointing",
        "moonlight is love",
        "Amazing phone",
        "Excellent phone under 10K",
        "Worth the price....A must buy for everyone with budget of around 10k-13k",
        "18w fast charger is best inside the box.",
        "Nice product",
        "Excellent"
    ],
    "neg-long-reviews": [
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌",
        "Febulas performance Redmi Note 8 ...I love it ..😍first time I parchase online and Amazon give full satisfaction of product.Thanks for Amazon 😘",
        "BEST PHONE UNDER 10K.OR UNDER 15K....CAMERA IS AWESOME.FEEL LIKE U USE A 20K PHONE.THE PHONE LOOKS SO COOL",
        "Phone hanged many times .I return it for replacement but not get back yet.Amazon shipping and replacement service is too bad. I uploaded a video....",
        "best mobile under 10000",
        "Pros- batteryCameraPriceLookCons- delicate. So has to be handled carefully.It took 10 days for the product to reach.",
        "Excellent phone under 10,000. Specialy 18 watt fast chargers🔋🔌.....if your budget is 10k u must buy it without any doubt...👍",
        "Loving the phone....Purchased with bank discount,6gb 128gb blue variant...i must say,it looks super awesome....having gorilla glass protection in front and back,it makes it even better....i would like to inform one thing that there is no 60fps video recording even after being mentioned on official website,and also there is no fingerprint gesture feature...it may come with miui 11 which is going to come within next 10 days as it is in phase 2 devices....Camera is really cool,getting some decent clicks,just install google camera and the quality is much much betterBattery backup is quite good as well,just turn off dual 4g,dont use volte if not necessary,turn of auto start for apps which u feel are not required,keep miui battery saver turned on for better backup,keep gps off when not needed,just do small adjustments and battery will surely last longerPerformance is also great considering the chipset you are getting,infact u also get 4g+ which is not even there on redmi note 7 pro and would never come also....so internet speed,call quality,signal strength...everything is impressiveI must say,in this price range,this phone totally deserves praises from all....i hope i tried to cover all points and helped people to look for this phone as a good option for them...All the best...",
        "Redmi note 8 is the best Smartphone under 10k of the year 2019",
        "Awesome mobile under 10K.",
        "Excellent phone in this price point 👌👌👌"
    ],
    "name1": "Redmi Note 8 (Neptune Blue, 4GB RAM, 64GB Storage)",
    "star-rating": "4.3 out of 5 stars"
}